def area(a, b): 
    '''
    Возвращает площадь прямоугольника со сторонами a и b

        Параметры:
            a (float): ширина прямоугольника
	    b (float): длина прямоугольника

        Возвращаемое значение:
            a * b (float): площадь прямоугольника

    '''
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника со сторонами a и b

        Параметры:
            a (float): ширина прямоугольника
	    b (float): длина прямоугольника

        Возвращаемое значение:
            (a + b) * 2 (float): периметр прямоугольника

    '''
    return (a + b) * 2 